import React from 'react'

export default () => {
    return <div style={{ padding: '30px 16px' }}>
        <div style={{ textAlign: 'center', fontSize: '17px', color: '#0D1333', fontWeight: 500 }}>火夫用户注册协议</div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '30px' }}>
            &nbsp;&nbsp;&nbsp;&nbsp;《火夫用户用户注册协议》（以下简称“本协议”）及其附加协议适用于访问和使用北京非火一夫科技有限公司提供的任何服务，包括但不限于其提供的“火夫”应用程序（以下简称火夫），请您认真阅读并充分理解本协议，尤其提请您重点关注和理解本协议中免除或者限制火夫责任的条款及对您的权利限制的条款。如果您对本协议的任何条款表示异议，您可以选择不注册。若您选择点击“注册”并完成注册，则表明您自愿接受本协议的所有条款，并同意接受本协议各项条款的约束。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            一、服务范围及区域
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            &nbsp;&nbsp;&nbsp;&nbsp;1、用户有权在火夫浏览数字资产实时行情信息。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            &nbsp;&nbsp;&nbsp;&nbsp;2、用户有权在火夫查看其账号下的信息，有权应用火夫提供的功能进行操作。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            &nbsp;&nbsp;&nbsp;&nbsp;3、特别提示：火夫并非向全球用户提供本服务，尤其确认暂不向以下地区的用户提供服务：古巴、伊朗、朝鲜、克里米亚、苏丹、叙利亚、美国 [ 包括所有美国领土，如波多黎各、美属萨摩亚、关岛、北马里亚纳岛以及美属维尔京群岛（圣克罗伊岛、圣约翰岛和圣托马斯岛）] 孟加拉国、玻利维亚、厄瓜多尔、吉尔吉斯斯坦和马耳他（以下简称“限制/禁止区域”）。用户知悉火夫的服务区域。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            二、服务规则
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            1、火夫作为为用户提供数字加密资产的信息共享平台，用户须为自己注册账号下的一切行为与后果负责，包括但不限于用户通过注册账号所传送的一切内容以及因此产生或可能产生的一切结果。用户应对火夫中的信息等内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对平台内容的正确性、完整性或实用性的依赖而产生的风险。火夫无法且不会对因用户行为而导致的任何损失或给第三方造成的损害承担任何责任。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            2、您在火夫传送的内容仅表明其个人的立场和观点，并不代表本公司及其关联方、合作方的立场或观点，火夫对此不承担任何责任。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            3、火夫为您提供数字加密资产信息共享服务，您需对您个人资料的真实性、合法性、有效性承担全部责任，禁止实施诸如冒充他人、以他人名义传播任何信息、恶意使用注册账号导致其他用户误认等行为，否则火夫有权立即停止提供全部或部分服务，收回火夫账号并由您独自承担由此产生的一切法律责任。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            4、您需同意，火夫对您在本平台及接受其它线上服务过程中发布的任何公开信息享有免费使用权，包括但不限于上传信息、数据、评论等。使用范围包括火夫应用内以及应用外其他法律允许的范围和区域。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            5、您须对已上传火夫所有信息的真实性、合法性、无害性、有效性等全权负责，与您传播的信息所产生的任何法律责任由您自行承担，与火夫无关。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            6、因业务发展需要，火夫可单方面保留在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销火夫全部或部分服务的权利，您需承担此风险。火夫更新相应条款后，您可在火夫官方网站查阅最新版协议条款，如您继续使用火夫，则视为您接受修改后的用户注册协议。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            7、火夫对您在本服务中浏览到的所有广告内容、文字与图片之说明、展示样品或其他销售资讯等信息的合法性、真实性、准确性不负担保责任，对此您应谨慎判断。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            8、您不得利用火夫或火夫相关服务制作、复制、发送如下内容：
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 反对宪法基本原则、实施法律或行政法规禁止行为的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 损害国家荣誉和利益的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4) 煽动民族仇恨、民族歧视，破坏民族团结的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪或侮辱、诽谤他人、侵害他人隐私或诋毁他人名誉、商誉的，包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (8) 传送有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒（包括但不限于木马程序、蠕虫、计时炸弹、删除蝇等）或其他计算机代码、档案和程序等资料的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (9) 干扰或破坏本服务或与本服务相连的服务器和网络，或不遵守本服务协议之规定的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (10) 以任何方式危害未成年人及他人的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (11) 跟踪或以其他方式骚扰他人的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (12) 未经合法授权而截获、篡改、收集、存储或删除他人信息、数据的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (13) 伪造标题或以其他方式操控识别资料，使人误认为该内容为火夫所传送的；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (14) 其它被火夫视为不当行为的。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            9、若您违反有关法律法规、本协议约定或发布传播侵犯、妨害、威胁任何人权利或安全的内容或者假冒他人的行为，火夫可依其单方的合理判断，有权停止传输服务中的任何内容并采取包括但不限于如下的法律行动：
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 从火夫服务中删除具有违法性、侵权性、不当性等内容；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 暂停或终止违反者的成员资格；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 阻止其使用火夫全部或部分服务；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4) 依据法律法规保存相关信息并向有关部门报告；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (5) 本平台认为可以采取的其它法律行动。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            10、您需确认，若非经司法部门确认火夫因故意或重大过失导致处置有误给您造成实际损失，火夫不承担由此造成的一切后果。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>



            11、为了改善用户体验、完善服务内容，火夫将不断努力开发新的服务，并为您不时提供更新服务。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>

            12、为了保证本服务的安全性和功能的一致性，火夫有权不经向您特别通知而对平台进行更新，或对平台及/或平台版块的部分功能效果进行改变或限制。同时，火夫将保留在任何时候通过为您提供平台功能强化、升级版本的权利以及平台升级等收取费用的权利。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>

            13、本平台将为您默认开通“升级提示”功能，您有权自行选择是否开通此功能。新版本发布后，火夫不保证旧版本是否继续可用以及是否会继续提供客户服务，您需承担此风险。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>

            14、火夫及/或合作单位将根据市场与技术的发展，向您提供与平台服务内容相关的各种免费或收费的互联网以及移动通信增值服务。火夫及/或合作方保留对相关增值服务收取费用及改变收费标准、方式的权利。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            若相关服务由免费变更为收费服务，火夫及/或合作方将以适当的形式通知，您可自主选择接受或拒绝收费服务。接受收费服务后，请您同意并保证按照火夫及/或合作方相关收费规定支付费用，若拒付或拖欠费用，火夫及/或合作方有权停止该项服务，造成损失将依法追偿。
        </div>

        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>

            15、用户权利及义务：
        </div>

        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 火夫享有火夫账号的所有权，初始申请注册人享有火夫账号的使用权，同时火夫有权禁止用户赠与、借用、租用、转让或售卖该注册账号。
        </div>

        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 用户有权更改、删除已上传火夫的个人资料、注册信息及使用、交易记录等，但需注意，删除有关信息的同时也会删除用户储存在系统中的相关文字和图片，用户需承担该风险。
        </div>

        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 用户有责任妥善保管注册账号信息及密码并保证其安全，需承担在该注册账号及密码下产生的任何法律责任。若您怀疑他人正在使用或曾经使用您的账号或密码时，请立即通知火夫，您可发送相关信息至火夫QQ群、火夫微信客户群、help@huofu.pro等。
        </div>

        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4) 用户应遵守本协议的各项条款，正确、适当地使用本服务，若因用户违反本协议中的任何条款，火夫有权依据该协议终止对违约用户提供全部或部分服务。同时，火夫保留在任何时候收回火夫账号、用户名的权利。
        </div>

        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (5) 若用户注册火夫账号后连续半年未在本平台登录使用，火夫有权注销该账号，以免造成资源浪费；账号注销后，火夫不对原账号中的数据及资产负责，由此产生的任何不利后果均由用户自行承担。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            三、隐私声明
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            1、信息收集
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333' }}>
            当您使用火夫或者其他火夫在线服务时，我们会在取得您同意或者给予您选择权的情况下，请求您提供自己的身份信息（个人信息）或者可以与您联系的如下信息：
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 您的姓名、性别、年龄、联系方式等个人基本信息；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 您在本平台的信息浏览记录、交易记录等信息；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 您的手机、邮箱通讯录中的联系人；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4) 您的微博、微信或其他社交网站的相关信息；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (5) 根据您使用火夫服务所需的其他信息，包括但不限于您的设备以及您设备中其它应用软件中记载的信息等。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333' }}>

            未经允许，火夫不会与第三方共享以上信息，但本声明已经列出的情况除外。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>

            2、信息使用
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333' }}>
            火夫及/或其关联保证合法、合理地使用您的个人信息，或者有充分理由相信必须这样做才能：

        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 符合国家法律法规的规定或火夫适用的法律程序。
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 充分履行火夫相关服务条款、许可使用协议。
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 维护火夫及其相关平台/网站的权利以及财产安全。
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4)在紧急情况下保护火夫员工、火夫产品或服务的用户以及大众的个人安全。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>


            3、信息保护
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333' }}>
            我们将提供多种途径以确保您的个人信息是准确及时安全的。在火夫注册后，您可以随时查阅、编辑或删除已提交本平台的个人信息、使用、交易记录等。我们会使用各种安全技术和程序来保护您的个人信息不被未经授权的人员访问、使用或泄漏。如果您对我们的隐私保护有任何置疑，请及时与我们联系，我们的电子邮箱为：help@huofu.pro。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            4、Cookie 的使用
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333' }}>
            当您借助Web浏览器使用火夫服务时，您会将一个或多个“Cookie”置入计算机中。如果您使用火夫账号登录到火夫网站或其他火夫服务，我们将设置或读取一个或多个其他 Cookie。我们将使用这些 Cookie 来运营火夫服务并为您提供更多相关的服务体验。您可以使用您的浏览器设置来删除或阻止您计算机上的 Cookie。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            5、对儿童及青少年个人信息的搜集和使用
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333' }}>
            儿童及青少年上网之趋势无可避免，但网络中确有不宜儿童及青少年接受的讯息。火夫十分重视和保护儿童及青少年的信息安全及其隐私权等，家长（或监护人）应注意以下几点：

        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 仔细阅读火夫相关服务条款及权利保障条款；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 持续叮嘱儿童及青少年不可泄漏自己及家人的任何资料（包括姓名、地址、电话、电子邮箱、照片、信用卡号等）给任何人；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 有权拒绝火夫进一步搜集其子女或被监护人的个人信息；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4) 未满12岁的儿童使用本软件时，家长（或监护人）应全程陪伴并指导、监督等；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (5) 火夫用户应为年满18周岁至65周岁的完全民事行为能力人，本平台对未成年人、无民事行为能力人、限制民事行为能力人及/或其家长（或监护人）的不当行为及非法行为不承担任何责任。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            四、免责声明
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            1、因您的违约行为，导致或产生任何第三方向火夫及/或其关联方、合作方等主张的任何索赔或要求，需由您同意并承担相应赔偿责任，包括但不限于律师费、差旅费等。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            2、火夫依照法律规定、协议约定履行基础性保障义务，但因下列原因导致的经济损失等，火夫及合作单位不承担责任：

        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 因第三方以及其它不可抗力原因遭受的一切损失，包括但不限于电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性等；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2) 因上述 (1) 项出现服务故障，火夫及合作方承诺并及时在第一时间内与相关主体配合进行了处理、修复。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>

            3、您需提高个人信息保护意识：本服务同大多数互联网服务一样，受各种因素影响，包括但不限于用户原因、网络服务质量、社会环境等。因此可能受到各种安全问题的侵扰，若他人利用您的资料进行虚拟或现实的跟踪、骚扰；在您接受其他公司的软件或网站服务时出现信息泄露、数据安全受到威胁继而影响本服务的正常使用等等。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            4、您需明白，因涉及Internet服务，使用本服务可能会受到各个环节不稳定因素的影响，存在服务中断或不能满足用户要求的风险，包括但不限于不可抗力、计算机病毒或黑客攻击、系统不稳定；因用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因不能发送和接受阅读信息、接发错信息等。您须承担以上风险，火夫不作担保、不承担任何责任。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            5、您需了解，在使用本服务过程中，您可能会受到来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为的影响或收到侵犯他人权利的（包括知识产权）的匿名或冒名的信息等，您需承担以上风险。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            6、火夫及/或关联方、合作方对本服务不作任何类型的担保，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件等，因此本公司对于您不正当或非法使用服务而产生的直接、间接、偶然、特殊及后续的损害不负任何责任。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            7、火夫定义的信息内容包括：文字表述及其组合、图片、声音、录像、图表、标志、标识、广告（包括广告本身及其中的内容）、商标、商号、域名、程序、版面设计、专栏目录与名称、内容分类标准、版面设计、排版方式、有关数据，用户提供的所有信息以及本公司为用户提供的商业信息等。以上信息内容受版权、商标权和其它知识产权和所有权法律的保护，用户应取得火夫和广告商授权才能使用，而不能擅自全部或局部复制、修改、编纂、链接以上内容或创造与内容有关的衍生产品。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            8、在任何情况下，火夫均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用火夫服务而遭受的利润损失，承担责任（即使火夫已被告知该等损失的可能性亦然）。尽管本协议中可能含有相悖的规定，火夫对您承担的全部责任，无论因何原因或何种行为方式，仅以您在成员期内因使用火夫服务而支付给火夫的费用为限(若有)。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            9、就下列相关事宜的发生，火夫不承担任何法律责任：


        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (1) 火夫根据法律规定或相关政府的要求提供您的个人信息；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (2 )由于您将用户密码告知他人或与他人共享注册帐户或其他非因火夫原因导致的任何个人信息、记录的泄漏或丢失等；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (3) 任何第三方根据火夫各服务条款及声明中所列明的情况使用您的个人信息，由此所产生的纠纷；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (4) 任何由于黑客攻击、电脑病毒侵入或政府管制而造成的暂时性关闭；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (5) 电信部门技术调整导致之重大影响；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (6) 因不可抗力导致的任何后果；
        </div>
        <div style={{ fontSize: '15px', color: '#5F6173' }}>
            (7) 火夫在各服务条款及声明中列明的使用方式或免责情形。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            五、知识产权保护
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>1、知识产权声明：本公司是火夫包括知识产权在内的无形财产权的权利人，平台的一切版权、商标权、专利权、商业秘密等包括知识产权在内的无形财产权以及与平台相关的所有信息内容，包括但不限于文字表述及其组合、图片、声音、录像、图表、标志、标识、广告、商标、商号、域名、程序、版面设计、专栏目录与名称、内容分类标准、版面设计、排版方式、有关数据等，均受《中华人民共和国著作权法》、《中华人民共和国商标法》、《中华人民共和国专利法》、《反不正当竞争法》及相应国际公约中有关著作权、商标权、专利权及/或其他财产所有权法律的保护，除涉及第三方授权的软件或技术外，火夫享有上述无形财产产权。

        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            2、未经火夫书面同意或许可，任何单位或个人不得擅自实施、利用、转让上述知识产权，不得擅自许可复制、链接、非法使用或转载。火夫保留追究上述未经许可行为的权利。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            六、争议解决        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            1、本协议的订立、效力、解释、履行、终止、解除和争议的解决等均适用中华人民共和国的法律。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            2、凡因本协议引起的或与本协议有关的任何争议，由双方协商解决；协商不成或不愿协商的，均提请北京仲裁委员会，按照申请仲裁时该会现行有效的仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', fontWeight: 500, marginTop: '30px' }}>
            七、其他条款        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>1、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            2、本公司未就用户或其他方的违约采取行动并不等于本公司放弃就随后或类似的违约采取行动的权利。
        </div>
        <div style={{ fontSize: '15px', color: '#0D1333', marginTop: '12px' }}>
            3、本协议解释权及修订权归北京非火一夫科技有限公司所有。
        </div>
    </div>
}